app/Models/UserModel.php

SELECT *
FROM `user`
WHERE `email` = '1234@gmail.com'
 LIMIT 1
---
    public function getUser($email, $password)
    {
        $user = $this->where('email', $email)->first();